/*
Тема курсового проекта - библиотека. 

Книг очень много и невозможно все запомнить, информация о колличестве будет находиться в (repository),
Таблица (books) будет хранить имя книг и краткое содержание. 
А еще уточняющие, такие как автор(authors), жанр(genres), издательство(publishing_office), год выпуска(year_edition). 
Есть таблица симпатии(likes) по которой можно будет выявить наиболее популярные из них.

Так же будут читатели, которые берут книги на прочтение.
У читателей есть таблица (profiles), где хранится информация о каждом из них.
Есть таблица (media) которая дает возможность посмотреть фотографии пользователей и авторов книг.

Таким образом появляется необходимость контроля, какие книги есть в библиотеке, кто взял книгу и на какой срок,
а кто может быть уже прочитал и вернул обратно. Эту необходимость поможет решить данный курсовой проект.
*/ 


